
var eM = new Array();

eM[0x0010] ="非法请求";

eM[0x0020] ="用户未激活";
eM[0x0021] ="用户不存在或者密码不正确";

eM[0x0030] ="用户名已经存在";
eM[0x0031] ="邮箱已经存在";
eM[0x0032] ="发送注册邮件失败";
eM[0x0033] ="旧密码不正确";
eM[0x0034] ="验证码失效";

eM[0x0040] ="公告不存在";

eM[0x0050] ="此选择题不存在";
eM[0x0051] ="此题不存在";

eM[0x0060] ="答案此前已经提交过";
eM[0x0061] ="WriteUp文件格式不对";

eM[0x0070] ="该队名已经存在";
eM[0x0071] ="该成员已加入其他队伍";
eM[0x0072] ="您还没有加入该队伍";
eM[0x0073] ="该队伍不存在";

eM[0x010b] ="该队伍没有报名参赛";
eM[0x0107] ="该队伍没有权限答此题";
eM[0x010d] ="主办方关闭排行榜";
eM[0x0051] ="没有该题目";

eM[0x0103] ="该队伍已经报名";
eM[0x0104] ="报名时间尚未开始";
eM[0x0105] ="报名时间已经结束";
eM[0x0106] ="该队伍已经提交答案";
eM[0x0107] ="该队伍没有查看权限";
eM[0x0108] ="只有队长才能报名";
eM[0x0074] ="需要组队才能参赛";
eM[0x010c] ="比赛暂停";
eM[0x0101] ="比赛结束";
eM[0x0011] ="请求太频繁了";
eM[0x0155] ="已经提交过该试卷";
eM[0x0200] ="环境总数超标";
eM[0x0201] ="个人环境总数超标";
eM[0x0202] ="环境申请失败！";

function getErrorMsg(errorCode) {

    if (errorCode == null || isNaN(errorCode) || errorCode < 0) {
        return "已经提交过了";
    }

    var msg = eM[errorCode];

    return msg;
}

